nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
        <register>
          <name>ACQ_FILT_0_3</name>
          <description>Acquisition Filter Coeffs 0~3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H0</name>
              <description>Acquisition Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H1</name>
              <description>Acquisition Filter Coefficient 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H2</name>
              <description>Acquisition Filter Coefficient 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3</name>
              <description>Acquisition Filter Coefficient 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_4_7</name>
          <description>Acquisition Filter Coeffs 4~7</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H4</name>
              <description>Acquisition Filter Coefficient 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H5</name>
              <description>Acquisition Filter Coefficient 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H6</name>
              <description>Acquisition Filter Coefficient 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H7</name>
              <description>Acquisition Filter Coefficient 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_8_9</name>
          <description>Acquisition Filter Coeffs 8~9</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H8</name>
              <description>Acquisition Filter Coefficient 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H9</name>
              <description>Acquisition Filter Coefficient 9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_10_11</name>
          <description>Acquisition Filter Coeffs 10~11</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H10</name>
              <description>Acquisition Filter Coefficient 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H11</name>
              <description>Acquisition Filter Coefficient 11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_FILT_0_1</name>
          <description>Demod Filter Coeffs 0~1</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H0</name>
              <description>Demod Channel Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H1</name>
              <description>Demod Channel Filter Coefficient 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_FILT_2_4</name>
          <description>Demod Filter Coeffs 2~4</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2</name>
              <description>Demod Channel Filter Coefficient 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3</name>
              <description>Demod Channel Filter Coefficient 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H4</name>
              <description>Demod Channel Filter Coefficient 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_0_3_DRS</name>
          <description>Acquisition Filter Coeffs 0~3 DRS</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H0</name>
              <description>Acquisition Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H1</name>
              <description>Acquisition Filter Coefficient 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H2</name>
              <description>Acquisition Filter Coefficient 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3</name>
              <description>Acquisition Filter Coefficient 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_4_7_DRS</name>
          <description>Acquisition Filter Coeffs 4~7 DRS</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H4</name>
              <description>Acquisition Filter Coefficient 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H5</name>
              <description>Acquisition Filter Coefficient 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H6</name>
              <description>Acquisition Filter Coefficient 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H7</name>
              <description>Acquisition Filter Coefficient 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_8_9_DRS</name>
          <description>Acquisition Filter Coeffs 8~9 DRS</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H8</name>
              <description>Acquisition Filter Coefficient 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H9</name>
              <description>Acquisition Filter Coefficient 9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_10_11_DRS</name>
          <description>Acquisition Filter Coeffs 10~11 DRS</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H10</name>
              <description>Acquisition Filter Coefficient 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H11</name>
              <description>Acquisition Filter Coefficient 11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_FILT_0_1_DRS</name>
          <description>Demod Filter Coeffs 0~1 DRS</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H0</name>
              <description>Demod Channel Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H1</name>
              <description>Demod Channel Filter Coefficient 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_FILT_2_4_DRS</name>
          <description>Demod Filter Coeffs 2~4 DRS</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2</name>
              <description>Demod Channel Filter Coefficient 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3</name>
              <description>Demod Channel Filter Coefficient 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H4</name>
              <description>Demod Channel Filter Coefficient 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI_GLOBAL_CTRL</name>
          <description>RSSI Global Control</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NB_RSSI_INPUT_SEL</name>
              <description>NB RSSI Input Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NB_RSSI_INPUT_SEL_0</name>
                  <description>ACQ_CHF output I/Q</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_RSSI_INPUT_SEL_1</name>
                  <description>SRC output I/Q</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_RSSI_INPUT_SEL_2</name>
                  <description>DEMOD_CHF output I/Q</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB_RSSI_AA_MATCH_OVRD</name>
              <description>NB RSSI PHY Trigger Override</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NB_RSSI_AA_MATCH_OVRD_EN</name>
              <description>NB RSSI PHY Trigger Override Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NB_RSSI_PA_AA_MATCH_SEL</name>
              <description>NB RSSI PHY Trigger Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NB_RSSI_PA_AA_MATCH_SEL_0</name>
                  <description>NB-RSSI starts work when PHY_PD_FOUND asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_RSSI_PA_AA_MATCH_SEL_1</name>
                  <description>NB-RSSI starts work when PHY_AA_MATCH asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB_CCA1_ED_EN</name>
              <description>NB RSSI CCA1 ED Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NB_CCA1_ED_EN_0</name>
                  <description>NB-RSSI CCA1/ED is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_CCA1_ED_EN_1</name>
                  <description>NB-RSSI CCA1/ED is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB_CONT_MEAS_OVRD</name>
              <description>NB RSSI Onetime Measure Override</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NB_CONT_MEAS_OVRD_EN</name>
              <description>NB RSSI One-time Measure Override Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NB_SNR_LQI_ENABLE</name>
              <description>NB RSSI SNR LQI Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NB_SNR_LQI_ENABLE_0</name>
                  <description>NB-RSSI SNR/LQI calculation is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_SNR_LQI_ENABLE_1</name>
                  <description>NB-RSSI SNR/LQI calculation is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA1_ED_FROM_NB</name>
              <description>CCA1/ED Result Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA1_ED_FROM_NB_0</name>
                  <description>WB-RSSI's CCA1/ED result is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA1_ED_FROM_NB_1</name>
                  <description>NB-RSSI's CCA1/ED result is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB_RSSI_EN</name>
              <description>NB RSSI Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NB_RSSI_EN_0</name>
                  <description>NB-RSSI is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_RSSI_EN_1</name>
                  <description>NB-RSSI is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_RSSI_INPUT_SEL</name>
              <description>WB RSSI Input Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WB_RSSI_INPUT_SEL_0</name>
                  <description>DCOC output I/Q</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WB_RSSI_INPUT_SEL_1</name>
                  <description>CIC output I/Q</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_CCA1_ED_EN</name>
              <description>WB RSSI CCA1 ED Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WB_CCA1_ED_EN_0</name>
                  <description>WB-RSSI CCA1/ED disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WB_CCA1_ED_EN_1</name>
                  <description>WB-RSSI CCA1/ED enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_CONT_MEAS_OVRD</name>
              <description>WB RSSI Continuous Measurment Override Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_CONT_MEAS_OVRD_EN</name>
              <description>WB RSSI Continuous Measurement Override Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_RSSI_EN</name>
              <description>WB RSSI Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WB_RSSI_EN_0</name>
                  <description>WB-RSSI is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WB_RSSI_EN_1</name>
                  <description>WB-RSSI is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
