nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
        <register>
          <name>RSM_RESULT_BUFF</name>
          <description>Ranging Sequence Manager Result Buffer</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_RESULT_BASE_ADDR</name>
              <description>RSM RESULT BUFFER BASE ADDRESS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RESULT_BUFF_LOC</name>
              <description>RSM RESULT BUFFER LOCATION</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_RESULT_BUFF_LOC_0</name>
                  <description>located in TX Packet RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_RESULT_BUFF_LOC_1</name>
                  <description>located in RX Packet RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_RESULT_DEPTH</name>
              <description>RSM RESULT BUFFER DEPTH</description>
              <bitOffset>15</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_RESULT_PTR</name>
          <description>Ranging Sequence Manager Config Pointer</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_RESULT_RD_PTR</name>
              <description>RSM RESULT READ POINTER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RESULT_RD_PAGE</name>
              <description>RSM RESULT READ PAGE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RESULT_START_PTR</name>
              <description>RSM RESULT START POINTER</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_PCBD_CTUNE_SEL</name>
              <description>RSM PCBD CTUNE SELECT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_BUFFER_ABORT_EN</name>
              <description>RSM BUFFER ABORT ENABLE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_PTR</name>
          <description>Ranging Sequence Manager Pointer</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_RD_PTR</name>
              <description>RSM CONFIG READ POINTER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_RD_PAGE</name>
              <description>RSM CONFIG READ PAGE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_WR_PTR</name>
              <description>RSM RESULT WRITE POINTER</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSM_WR_PAGE</name>
              <description>RSM RESULT WRITE PAGE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO2HOST</name>
          <description>Radio to Host Buffer</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO2HOST_DATA</name>
              <description>Data of Buffer0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST2RADIO</name>
          <description>Host to Radio Buffer</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOST2RADIO_DATA</name>
              <description>Data of Buffer0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CHANNEL0</name>
          <description>skip coex rf_denied for channel 0 to 31</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_0_31</name>
              <description>Coexistence Allowed Channel Table0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CHANNEL1</name>
          <description>skip coex rf_denied for channel 32 to 63</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_32_63</name>
              <description>Coexistence Allowed Channel Table1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CHANNEL2</name>
          <description>skip coex rf_denied for channel 64 to 95</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_64_95</name>
              <description>Coexistence Allowed Channel Table2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CHANNEL3</name>
          <description>skip coex rf_denied for channel 96 to 127</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_96_127</name>
              <description>Coexistence Allowed Channel Table3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_MODE</name>
          <description>Coexistence mode</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_BLE_EARLY_EVENT</name>
              <description>Coexistence early start btle enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_DUALPRIO</name>
              <description>Coexistence dual priority</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_PRIO1_SW</name>
              <description>Coexistence dual priority</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_CS_EN</name>
              <description>Coexistence cs rf_deny enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_CS_DUALREQ</name>
              <description>Coexistence cs dual req mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_CS_DUALPHASE</name>
              <description>Coexistence cs dual phase mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_ALLOW_CHANNEL_EN</name>
              <description>Coexistence allow channel enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_CONFLICT_CHANNEL_EN</name>
              <description>Coexistence conflict channel enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_STATUS</name>
          <description>Coexistence status</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_STATUS</name>
              <description>Coexistence status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_INT_STATUS</name>
          <description>Interrupt status for all coex and dma sources</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>XCVR_IRQ_IPS_WR_XFR_ERR</name>
              <description>XCVR_IRQ_IPS_WR_XFR_ERR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_DMA_LITE_END</name>
              <description>XCVR_IRQ_DMA_LITE_END</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_BTA</name>
              <description>XCVR_IRQ_RF_DENY_BTA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_FALL</name>
              <description>RSM_IRQ_RF_DENY_FALL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_RISE</name>
              <description>RSM_IRQ_RF_DENY_RISE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_INT_ENABLE</name>
          <description>Interrupt enable for all coex and dma sources</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XCVR_IRQ_IPS_WR_XFR_ERR_EN</name>
              <description>XCVR_IRQ_IPS_WR_XFR_ERR_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_DMA_LITE_END_EN</name>
              <description>XCVR_IRQ_DMA_LITE_END_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_BTA_EN</name>
              <description>XCVR_IRQ_RF_DENY_BTA_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_FALL_EN</name>
              <description>XCVR_IRQ_RF_DENY_FALL_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_RISE_EN</name>
              <description>XCVR_IRQ_RF_DENY_RISE_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
