nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
        <register>
          <name>ble_reg_ant_switch_tx_map_4</name>
          <description>Tx Antenna Switch Map: Map 4</description>
          <addressOffset>0x914</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_5</name>
          <description>Tx Antenna Switch Map: Map 5</description>
          <addressOffset>0x918</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_6</name>
          <description>Tx Antenna Switch Map: Map 6</description>
          <addressOffset>0x91C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_7</name>
          <description>Tx Antenna Switch Map: Map 7</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_8</name>
          <description>Tx Antenna Switch Map: Map 8</description>
          <addressOffset>0x924</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_9</name>
          <description>Tx Antenna Switch Map: Map 9</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_cntrl</name>
          <description>Rx Antenna Switch Control, Control register of Bluetooth Rx antenna switching.</description>
          <addressOffset>0x930</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x16868</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_delay_1m</name>
              <description>Antenna Switch Delay from start of Rx Crc, Timer delayed from start of CRC of the current Rx packet to start driving requestAntenna to signal BCA which antenna is used for the expected Rx extension field., - Resolution: 0.25 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_delay_2m</name>
              <description>Antenna Switch Delay from start of Rx Crc, Timer delayed from start of CRC of the current Rx packet to start driving requestAntenna to signal BCA which antenna is used for the expected Rx extension field. This delay is for BLE Rx 2 Mbps., - Resolution: 0.25 usec.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_map_length</name>
              <description>Antenna Switch Map Length for Rx DFE, - Valid length of Rx antenna map pattern (max: 40). After executing the antenna switching for this length; BLE will repeat the pattern from the beginning. The map is used when BLE is receiving extension packets.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_rate</name>
              <description>Antenna Switch Rate, Define the antenna switching rate for extension packet., 0x0: switch antenna every 4 usec, 0x1: switch antenna every 2 usec, 0x2: switch antenna every 1 usec (RFU), 0x3: not valid</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ref_ant</name>
              <description>BCA reference antenna, The value of reference antenna held by BCA.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_ant_switch_en</name>
              <description>Antenna Switch Enable for Rx DFE, Switch antenna for extension when receiving location packet., 0x0: disable antenna switch for Rx DFE, 0x1: enable antenna switch for Rx DFE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
