nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
        <register>
          <name>btu_pta_harq_pattern_sel_refclk_1</name>
          <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF26</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqpatternsel_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, Contains the upper 10-bit of the referenceClock[27:2] when the HARQ_Pattern_Sel_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_harq_pattern_sel_refpdb_cnt</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqpatternsel_pdbitcnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, Contains the reference pdBitCounter[12:0] when the HARQ_Pattern_Sel_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_harq_pattern_sel_val</name>
          <description>MWS Coex Signal HARQ_PATTERN_SEL Value</description>
          <addressOffset>0xF2A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqpatternselreg</name>
              <description>MWS Coex Signal HARQ_PATTERN_SEL Value, Contains the new HARQ_PATTERN_SEL value being received. When new HARQ_PATTERN_SEL is detected; the HARQ_Pattern_Sel_Real_Int real-time interrupt will be generated and new value of HARQ_PATTERN_SEL will be saved in here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>mwsinactmsgreg</name>
              <description>MWS Coex Signal MWS_INACT_MSG Value, Contains the new MWS_INACT_MSG value being received. When new MWS_INACT_MSG is detected; the MWS_Inact_Msg_Real_Int real-time interrupt will be generated and new value of MWS_INACT_MSG will be saved here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_info_delay_timer</name>
          <description>PTA Info Delay Timer</description>
          <addressOffset>0xF2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_info_delay</name>
              <description>Bluetooth Sniff Interval, When BT_Coex_Mode is set to MRVL mode; this is the time transition time for each of the PTA info bits (i.e.; priority bits) that are serially encoded on BT_STATE line., A value of 0 is invalid; and will lead to unknown results., - Unit: 0.25 us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ble_sync_ctrl</name>
          <description>PTA BLE Sync Control</description>
          <addressOffset>0xF32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_sync_priority</name>
              <description>BLE Sync Priority, Sets Priority (sync_priority) for sync frame. The bt_state encodes if the current request is a sync frame or a regular frame. Each frame also has a 2-bit priority. BLE firmware sync_priority value if BLE controls the radio.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_dir</name>
              <description>BLE Sync Direction, Controls the direction of the sync frame (sync_dir). BLE firmware sync_dir value if BLE controls the radio., 0x0: Rx first, 0x1: Tx first</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_frame_fw_val</name>
              <description>BLE Sync Frame Firmware Value, BLE firmware sync_frame value if BLE controls the radio.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_frame_extend</name>
              <description>BLE Sync Frame Extend, BLE firmware sync_frame value will be extended (kept asserted) if BLE keeps controlling the radio. However; sync_frame value will be reset if BLE ongoing event got cutoff or abort., 0x0: sync_frame value will be de-asserted at falling edge of bt_req, 0x1: sync_frame value will be extended</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_pri_inc_ebram_addr</name>
          <description>EBRAM Base Address: PTA Priority Escalation</description>
          <addressOffset>0xF34</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1540</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ebram_addr</name>
              <description>EBRAM Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_sync_ctrl</name>
          <description>PTA Voice/WLAN Sync Control</description>
          <addressOffset>0xF36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sync_mode_en</name>
              <description>Sync Mode Enable, Enable MRVL Coexistence syncModel mode. The BT_STATE encodes if the current request is a sync frame or a regular frame. Each frame also has a 2-bit sync frame priority and a sync frame direction bit., If MRVL Coexistence syncModel mode is on; 4 more sync frame coexistence info are encoded sequentially on BT_STATE before other coexistence info:, 1. Sync Frame (sync_frame), 2. Sync Priority[0] (sync_priority[0]), 3. Sync Priority[1] (sync_priority[1]), 4. Sync Direction (sync_dir)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ble_tx_pwr_thrhd</name>
          <description>BLE Tx Power Threshold to Suppress Tx Overlap Assertion</description>
          <addressOffset>0xF38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble1m_tx_pwr_thrshld</name>
              <description>BLE Tx power threshold for 1 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble2m_tx_pwr_thrshld</name>
              <description>BLE Tx power threshold for 2 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_state_delay_timer</name>
          <description>PTA Bt_State Delay Timer</description>
          <addressOffset>0xF42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_state_delay</name>
              <description>PTA State Delay, When BT_Coex_Mode is in MRVL mode; this controls the delay for the BT_STATE transition for the second transaction., This value should never be programmed less than 15us; otherwise unexpected behavior will occur; such as dropped packets., - Unit: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_slna_ctrl</name>
          <description>PTA SLNA Control</description>
          <addressOffset>0xF44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_use_slna</name>
              <description>BLE uses SLNA based on RSSI info, Among all Bluetooth link RSSI average information; software decides which path BLE traffic will use for Rx; for example; SLNA or path 3 of Bluetooth only., 0x0: use path 3 for Bluetooth only based on BLE RSSI average, 0x1: enable SLNA path based on BLE RSSI average</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_slna_cp_en_bp_sel</name>
              <description>BLE side enable SLNA bias/charge pump bypass for software control, By default; slna_cp_en is dynamically control by rifRx because it requires 120us in advance. However; software can bypass it to control this enable by ble_slna_cp_en_bp_val with this selection bit is set., 0x0: use hardware dynamically controlled SLNA_cp_en, 0x1: software bypass to control the SLNA_cp_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_slna_cp_en_bp_val</name>
              <description>SLNA_cp Enable, When ble_slna_cp_en_by_sel is set; this value controls if SLNA_cp is enabled., When ble_slna_cp_en_by_sel is set; software controls SLNA_cp_en to enable or disable by this bit., 0x0: eisable SLNA cp, 0x1: enable SLNA cp</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_tx_power_threshold</name>
          <description>Tx Power Threshold to Suppress Tx Overlap Assertion</description>
          <addressOffset>0xF46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bdr_tx_pwr_thrshld</name>
              <description>Tx power threshold for BDR packet to suppress bt_overlap/bt_scan_overlap assertion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>edr_tx_pwr_thrshld</name>
              <description>Tx power threshold for EDR packet to suppress bt_overlap/bt_scan_overlap assertion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_tx_overlap_range</name>
          <description>MWS Frequency Overlap Range for Bluetooth Tx Slot</description>
          <addressOffset>0xF48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BR/EDR Tx Slots, Under MWS Coex Mode; MWS frequency overlap range for BR/EDR Tx slots., Bit[7] direction bit:, - Bits[6:0] value: overlap boundary channel, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit being 0 represents the upper boundary channel and all smaller index channels thereof are fallen in the overlap range; whereas the bit begin 1 represents the lower boundary channel and all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1: lower boundary</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_tx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BLE Tx packets, Under MWS Coex Mode; MWS frequency overlap range for BLE Tx packets., Bit[7] direction bit:, - Bits[6:0] value: overlap boundary channel, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit being 0 represents the upper boundary channel and all smaller index channels thereof are fallen in the overlap range; whereas the bit begin 1 represents the lower boundary channel and all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1: lower boundary</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_rx_overlap_range</name>
          <description>MWS Frequency Overlap Range for Bluetooth Rx Slot</description>
          <addressOffset>0xF4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BR/EDR Rx Slots, Under MWS Coex Mode; MWS frequency overlap range for BR/EDR Rx slots., Bit[7] direction bit:, - Bits[6:0] value: overlap boundary, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit being '0' represents the upper boundary channel and all smaller index channels thereof are fallen in the overlap range; whereas the bit begin '1' represents the lower boundary channel and all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1: lower boundary</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BLE Rx Packets, Under MWS Coex Mode; MWS frequency overlap range for BLE Rx packets., Bit[7] direction bit:, - Bits[6:0] value: overlap boundary, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit being '0' represents the upper boundary channel and all smaller index channels thereof are fallen in the overlap range; whereas the bit begin '1' represents the lower boundary channel and all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1: lower boundary</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_coex_bt_tx_on_start</name>
          <description>MWS Coex Signal BT_TX_ON Start Timer</description>
          <addressOffset>0xF4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bttxonstartreg</name>
              <description>BT_TX_ON Start Timer, Under MWS Coex Mode; btTxOnStartReg determines the delay from rifTx assertion to the rising edge of BT_TX_ON. The time between the rising edge of BT_TX_ON to the rifTx assertion is (btTxOnStartReg+1) unit of 0.25us., This value should never be program less than 1; other wise unexpected behavior will occur., - Resolution: 0.25 us., Since this signal can only assert on successful grant from BCA; this timing needs to be greater than the delay from rifTx to bca_grant_n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_coex_bt_tx_on_end</name>
          <description>MWS Coex Signal BT_TX_ON End Timer</description>
          <addressOffset>0xF4E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bttxonendreg</name>
              <description>BT_TX_ON End Timer, Under MWS Coex Mode; btTxOnEndReg determines the delay from rifTx de-assertion to the falling edge of BT_TX_ON. The time between the falling edge of BT_TX_ON to the rifTx de-assertion is (btTxOnEndReg+1) unit of 0.25us., This value should never be program less than 1; otherwise unexpected behavior will occur., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_coex_bt_rx_pri_start_mst</name>
          <description>MWS Coex Signal BT_RX_PRI Start Timer for Master Mode</description>
          <addressOffset>0xF50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btrxpristartmstreg</name>
              <description>BT_RX_PRI Start Timer for Master Mode, In Real Time mode; btRxPriStartMstReg determines the delay from rifRx (if bt_rx_pri_mst_tm_sel/bt_rx_pri_page_resp_tm_sel/bt_rx_pri_inq_resp_tm_sel = 0) or rifTx (if bt_rx_pri_mst_tm_sel/bt_rx_pri_page_resp_tm_sel/bt_rx_pri_inq_resp_tm_sel = 1) assertion to the rising edge of BT_RX_PRI. The time between the rising edge of BT_RX_PRI to the rifRx (or rifTx) assertion is (btRxPriStartMstReg+1) unit of 0.25us., This value should never be program less than 1; other wise unexpected behavior will occur., - Resolution: 0.25 us., Since this signal can only assert on successful grant from BCA; this timing needs to be greater than the delay from rifRx (or rifTx) to bca_grant_n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_coex_bt_rx_pri_end</name>
          <description>MWS Coex Signal BT_RX_PRI End Timer</description>
          <addressOffset>0xF52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btrxpriendreg</name>
              <description>BT_RX_PRI End Timer, Under MWS Coex Mode; btRxPriEndReg determines the delay from rifRx de-assertion to the falling edge of BT_RX_PRI The time between the falling edge of BT_RX_PRI to the rifRx de-assertion is (btRxPriEndReg+1) unit of 0.25us., This value should never be program less than 1; otherwise unexpected behavior will occur., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_framesync_refclk_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF54</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsframesync_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt, Contains the lower 16-bit of the referenceClock[27:2] when the MWS frame sync interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_framesync_refclk_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF56</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsframesync_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt, Contains the upper 10-bit of the referenceClock[27:2] when the MWS frame sync interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
