nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ANAREG_0</name>
      <description>CCM32K</description>
      <groupName>ANAREG</groupName>
      <baseAddress>0x4018A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FRO32K_CTRL</name>
          <description>Free Running 32 kHz Oscillator Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x880001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRO_EN</name>
              <description>FRO Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO_EN0</name>
                  <description>FRO is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO_EN1</name>
                  <description>FRO is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_EN</name>
              <description>Write Access Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_EN0</name>
                  <description>Register write access is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_EN1</name>
                  <description>Register write access is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRO32K_TRIM</name>
          <description>Free Running 32 kHz Oscillator Trim Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQ_TRIM</name>
              <description>Frequency Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQ_TRIM1024</name>
                  <description>Default trim value</description>
                  <value>0x400</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFR_DIS</name>
              <description>IFR Loading Disable Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFR_DIS0</name>
                  <description>IFR loading is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFR_DIS1</name>
                  <description>IFR loading is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_EN</name>
              <description>Write Access Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_EN0</name>
                  <description>Register write access is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_EN1</name>
                  <description>Register write access is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32K_CTRL</name>
          <description>32 kHz OSC Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_EN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_EN0</name>
                  <description>Oscillator is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_EN1</name>
                  <description>Oscillator is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_BYP_EN</name>
              <description>Crystal Oscillator Bypass Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_BYP_EN0</name>
                  <description>Crystal oscillator is not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_BYP_EN1</name>
                  <description>Crystal oscillator is bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_CLKMON_EN</name>
              <description>Crystal Oscillator Internal Clock Monitor Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_CLKMON_EN0</name>
                  <description>Oscillator internal clock monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_CLKMON_EN1</name>
                  <description>Oscillator internal clock monitor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_TRIM</name>
              <description>SOX Capacitor Trim</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SEL_EN</name>
              <description>Crystal Load Capacitance Selection Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_SEL_EN0</name>
                  <description>Internal capacitance bank is not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_SEL_EN1</name>
                  <description>Internal capacitance bank is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTAL_CAP_SEL</name>
              <description>Crystal load capacitance selection bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL1</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL2</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL3</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL4</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL5</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL6</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL7</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL8</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL9</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL10</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL11</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL12</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL13</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL14</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTAL_CAP_SEL15</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_CAP_SEL</name>
              <description>Crystal load capacitance selection bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL1</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL2</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL3</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL4</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL5</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL6</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL7</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL8</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL9</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL10</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL11</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL12</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL13</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL14</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CAP_SEL15</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP_TRIM</name>
              <description>SOX Comparator trim</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_HP_EN</name>
              <description>Crystal Oscillator High Power Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_HP_EN0</name>
                  <description>Oscillator high-power mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_HP_EN1</name>
                  <description>Oscillator high-power mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COARSE_AMP_GAIN</name>
              <description>Amplifier gain adjustment bits to allow the use of a wide range of external crystal ESR values.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COARSE_AMP_GAIN0</name>
                  <description>ESR_Range0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COARSE_AMP_GAIN1</name>
                  <description>ESR_Range1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COARSE_AMP_GAIN2</name>
                  <description>ESR_Range2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COARSE_AMP_GAIN3</name>
                  <description>ESR_Range3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOX_EN</name>
              <description>Crystal mode enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOX_EN1</name>
                  <description>Not supported for crystal mode operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOX_EN0</name>
                  <description>Required for crystal mode operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_DET</name>
              <description>Supply Detector Trim</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_TRIM</name>
              <description>SOX Delay Selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_EN</name>
              <description>Write Access Lock bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_EN0</name>
                  <description>Register write access is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_EN1</name>
                  <description>Register write access is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
