nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
        <register>
          <name>PRS7</name>
          <description>Priority Target Registers</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x43210</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0</name>
              <description>Initiator 0 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or the lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1</name>
              <description>Initiator 1 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M2</name>
              <description>Initiator 2 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8the or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M3</name>
              <description>Initiator 3 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8the or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4</name>
              <description>Initiator 4 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRS7</name>
          <description>Control Register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARK</name>
              <description>Park</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>initiator_port_0</name>
                  <description>Park on initiator port M0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_1</name>
                  <description>Park on initiator port M1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_2</name>
                  <description>Park on initiator port M2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_3</name>
                  <description>Park on initiator port M3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_4</name>
                  <description>Park on initiator port M4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_5</name>
                  <description>Park on initiator port M5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_6</name>
                  <description>Park on initiator port M6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_7</name>
                  <description>Park on initiator port M7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCTL</name>
              <description>Parking Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>park</name>
                  <description>When no initiator makes a request, the arbiter parks the target port on the initiator port defined by the PARK field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port</name>
                  <description>When no initiator makes a request, the arbiter parks the target port on the last initiator to be in control of the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>safe_state</name>
                  <description>When no initiator makes a request, the target port is not parked on a initiator and the arbiter drives all outputs to a constant safe state.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Fixed priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR</name>
                  <description>Round-robin(RR) or rotating priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HLP</name>
              <description>Halt Low Priority</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMH</name>
                  <description>The low-power mode request has the highest priority for arbitration on this target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPML</name>
                  <description>The low-power mode request has the lowest initial priority for arbitration on this target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read Only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>writeable</name>
                  <description>The target port's registers are writeable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bus_err</name>
                  <description>The target port's registers are read-only and cannot be written. Attempted writes do not affect the registers and result in a bus error response.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
