nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC2/KW43B43ZC2.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CTI</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CMC0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH2</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH4</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH5</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH6</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH7</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH8</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH9</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH10</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH11</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH12</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH13</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH14</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH15</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>EWM0</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>MCM0</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>MSCM0</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SYSCON0</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>SECCON0</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>SPC0</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>WUU0</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>WDOG0</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>WDOG1</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>CDOG0</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>CDOG1</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>SCG0</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>SFA0</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>FMU0</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>SFA1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>DSB0</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>TRDC0</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>RTC_Alarm</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>RTC_Seconds</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>LPTMR1</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>LPIT0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TPM_0</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>TPM_1</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>TPM_2</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>TPM_3</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TPM_4</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>MU1</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>SYSCON0_ECC</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>LPSPI2</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>LPUART0</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>RF_ZIGBEE</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>RF_Generic</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>RF_BRIC</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>RF_LCL</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>RF_WOR</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>RFMC</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>COEX_INT</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>GPIOA_INT0</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>GPIOA_INT1</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>GPIOB_INT0</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>GPIOB_INT1</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>GPIOC_INT0</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>GPIOC_INT1</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>GPIOD_INT0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIOD_INT1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0_CMP</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0_CAP</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0_RELOAD</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1_CMP</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1_CAP</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1_RELOAD</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2_CMP</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2_CAP</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2_RELOAD</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD_ERROR</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_FAULT</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>ITRC</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>TDET</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>MU0</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>INTM</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>SGI</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>SECURE_ERR</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>PKC</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>FLASH_Arbiter</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>BLE_INT0</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>BLE_INT1</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>BLE_INT2</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>BRF_INT</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>T1_INT</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>T2_INT</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>T3_INT</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>T4_INT</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>WDG1</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>OSC_32M_READY</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>RBME_INT</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>RSM_INT</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>PLL_ABORT_INT</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>DMA_LIGHT</name>
        <value>112</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
